<?php

namespace Database\Seeders;

use App\Models\Tag;
use Illuminate\Database\Seeder;

class TagSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $tags = [
            'تکنولوژی',
            'فناوری اطلاعات',
            'برنامه‌نویسی',
            'هوش مصنوعی',
            'یادگیری ماشین',
            'اینترنت اشیا',
            'امنیت سایبری',
            'برنامه‌نویسی وب',
            'موبایل',
            'اپلیکیشن',
            'طراحی رابط کاربری',
            'تجربه کاربری',
            'دیجیتال مارکتینگ',
            'سئو',
            'بازاریابی محتوا',
            'شبکه‌های اجتماعی',
            'تجارت الکترونیک',
            'استارتاپ',
            'کارآفرینی',
            'مدیریت کسب و کار',
            'اقتصاد',
            'سرمایه‌گذاری',
            'مالی',
            'سرمایه',
            'بازار سرمایه',
            'کسب و کار آنلاین',
            'آموزش',
            'دانشگاه',
            'تحصیل',
            'مهارت',
            'توسعه فردی',
            'مدیریت زمان',
            'رهبری',
            'کار تیمی',
            'ارتباطات',
            'سلامت',
            'سلامتی',
            'ورزش',
            'تغذیه',
            'روانشناسی',
            'سبک زندگی',
            'فرهنگ',
            'هنر',
            'ادبیات',
            'سینما',
            'موسیقی',
            'سفر',
            'گردشگری',
            'عکاسی',
            'محیط زیست',
        ];

        foreach ($tags as $tag) {
            Tag::create(['title' => $tag]);
        }
    }
}
